In [1]:
import pandas as pd

In [7]:
df=pd.read_csv('sales_data.csv')

In [3]:
df.head()

   o;?Month Store  Sales
0  01/01/19     A    100
1  01/02/19     A    300
2  01/03/19     A    500
3  01/01/19     B     50
4  01/02/19     B    300

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   o;?Month  12 non-null     object
 1   Store     12 non-null     object
 2   Sales     12 non-null     int64
dtypes: int64(1), object(2)
memory usage: 416.0+ bytes

In [5]:
df.describe()

            Sales
count   12.000000
mean   187.500000
std    129.903811
min     50.000000
25%    100.000000
50%    175.000000
75%    225.000000
max    500.000000

In [14]:
df=df.rename(columns= {"o;?Month":'Month'} )

In [15]:
df['Month'] = pd.to_datetime(df['Month'])

In [26]:
a=df.groupby(['Month'])['Sales'].max()

Month
2019-01-01    200
2019-01-02    300
2019-01-03    500
Name: Sales, dtype: int64

SyntaxError: invalid syntax (<ipython-input-116-579b1090d575>, line 1)

In [110]:
a=df.groupby(['Month','Store'])['Sales'].sum().to_frame()
a=a[a['Sales']>100].reset_index()
a=a.groupby(['Month','Store']).size().reset_index(name="count")
a.groupby('Month')['count'].sum().reset_index(name="Sales_gt_100")

       Month  Sales_gt_100
0 2019-01-01             2
1 2019-01-02             3
2 2019-01-03             2

In [66]:
a=df.groupby(['Month','Store'])['Sales'].sum().to_frame()

In [67]:
a

                  Sales
Month      Store
2019-01-01 A        100
           B         50
           C        200
           D        150
2019-01-02 A        300
           B        300
           C        200
           D        100
2019-01-03 A        500
           B         50
           C        100
           D        200

In [68]:
a=a[a['Sales']>100].reset_index()

In [69]:
a=a.groupby(['Month','Store']).size().reset_index(name="count")

In [70]:
a

       Month Store  count
0 2019-01-01     C      1
1 2019-01-01     D      1
2 2019-01-02     A      1
3 2019-01-02     B      1
4 2019-01-02     C      1
5 2019-01-03     A      1
6 2019-01-03     D      1

In [72]:
a.groupby('Month')['count'].sum().reset_index(name="Sales_gt_100")

       Month  Sales_gt_100
0 2019-01-01             2
1 2019-01-02             3
2 2019-01-03             2

In [102]:
df['Sales']

0     100
1     300
2     500
3      50
4     300
5      50
6     200
7     200
8     100
9     150
10    100
11    200
Name: Sales, dtype: int64

In [107]:
def check(value):
    if value <= 150:
        return 'a'
    elif value <= 299 and value >= 151:
        return 'b'
    elif value >= 300:
        return 'c'

In [117]:
df['Sales'].apply(check).value_counts().to_frame()

   Sales
a      6
c      3
b      3

In [114]:
df.groupby(['Store','Month'])['Sales'].sum()

Store  Month
A      2019-01-01    100
       2019-01-02    300
       2019-01-03    500
B      2019-01-01     50
       2019-01-02    300
       2019-01-03     50
C      2019-01-01    200
       2019-01-02    200
       2019-01-03    100
D      2019-01-01    150
       2019-01-02    100
       2019-01-03    200
Name: Sales, dtype: int64